.tsung/zy-login-tag-post-tag-20221118-0531/zy-login-tag-post-tag-20221118-0531/test_zy_new.xml
<?xml version="1.0"?><tsung loglevel="info">	
<clients>
  <client host="localhost" use_controller_vm="true"/>
</clients>

<servers>
  <server host="panda.eba-gaci4fx8.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

<load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="0.5" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="0.2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="0.1" unit="second"/>
    </arrivalphase>
</load>

  <options>
    <option name="global_ack_timeout" value="10000"/>
    <option name="file_server" id="userlist" value="user.csv"/>
  </options>

    <sessions>
    <session name="example" probability="100" type="ts_http">
    <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->         io:format([126, $p, 126, $n, 126, $n], [DynVars]),         ok end.">
        <var name="dump"/>
      </setdynvars>
      <transaction name="LOG_IN">
        <setdynvars sourcetype="file" fileid="userlist" delimiter="," order="iter">
          <var name="name"/>
          <var name="password"/>
          <var name="email"/>
          <var name="points"/>
        </setdynvars>
        <request>
          <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"/>
          <http url="/" method="GET" version="1.1"/>
        </request>
        <request> <http url="/login" method="GET" version="1.1"/> </request>
        <request subst="true">
          <dyn_variable name="loginstatus" re="(.*)"/>
          <dyn_variable name="userid" re="Location: http://.*/users/(.*)\r"/>
          <http url="/login" contents="authenticity_token=%%_authenticity_token%%&amp;session[email]=%%_email%%&amp;session[password]=test" method="POST" version="1.1">
          </http>
        </request>
      </transaction>

     <setdynvars sourcetype="random_number" start="1" end="99">
     <var name="rndPid"/>
     </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="9">
     <var name="rndTid"/>
     </setdynvars>

    <transaction name="VIEW_TAG">
    <request subst="true">
    <http url="/tags/%%_rndTid%%" method="GET" version="1.1"/>
    </request>
    </transaction>

    <transaction name="VIEW_POST">
    <request subst="true">
    <http url="/posts/%%_rndPid%%" method="GET" version="1.1"/>
    </request>
    </transaction>

    <transaction name="BACK_TO_HOME_PAGE">
    <request> <http url="/" method="GET" version="1.1"/> </request>
    </transaction>

    <transaction name="VIEW_ANOTHER_TAG">
    <request subst="true">
    <http url="/tags/%%_rndTid%%" method="GET" version="1.1"/>
    </request>
    </transaction>
    </session>
  </sessions>
</tsung>